import pandas as pd
from typing import List

# ===Дополни файл своим кодом - реализуй данные функции===

# def fit(train_data: pd.DataFrame) -> None:
#     """
#       Раскомментируй и пиши код здесь
#       Обучает модель на тренировочном датасет
#       train_data - данные для обучения       
#     """

# def recommend(user_id: int, k: int) -> List[int]:
#     """
#       Раскомментируй и пиши код здесь
#       Возвращает список из k item_id, рекомендованных пользователю.
#       user_id - пользователь, для которого подбираются рекоммендации
#       k - число соседей   
#     """


#def evaluate(test_data: pd.DataFrame, relevant_rating = 4) -> float:
#     """
#       Раскомментируй и пиши код здесь
#       Оценивает модель на тестовой выборке и возвращает значение метрики (например, RMSE, precision@5).
#       Релевантные товары те, у которых рейтинг выше или равно 4
#       test_data - данные для рассчета метрики  
#     """
#     #Раскомментируй и пиши код здесь



# Если тебе потребуются дополнительные функции, можешь смело их добавлять, они не будут учитываться при проверке. Использовать классы нельзя!
# Тебе предложен датасет для проверки работы твоей программы, его можно скачать на той же странице, что и этот файл